app/Controllers/Admin.php

    public function users() {
        $userModel = new UserModel();
        $data['users'] = $userModel->findAll();
---
SELECT *
FROM `users`

    public function transaksi() {
        $trxModel = new TransaksiModel();
        $data['transaksi'] = $trxModel
            ->select('transaksi.*, users.nama')
            ->join('users', 'users.id = transaksi.user_id')
            ->findAll();
---
SELECT `transaksi`.*, `users`.`nama`
FROM `transaksi`
JOIN `users` ON `users`.`id` = `transaksi`.`user_id`