app/Controllers/Landing.php

SELECT `transaksi`.*, `users`.`nama`
FROM `transaksi`
JOIN `users` ON `users`.`id` = `transaksi`.`user_id`
ORDER BY `waktu` DESC
 LIMIT 1
---
    public function index() {
        $trxModel = new TransaksiModel();
        $data['last'] = $trxModel
            ->select('transaksi.*, users.nama')
            ->join('users', 'users.id = transaksi.user_id')
            ->orderBy('waktu', 'DESC')
            ->first();